Public Member Functions | List of all members
API_IEventHandler Class Referenceabstract
Notifications Manager
Defining an interface for all event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IEventHandler:
 Public Member Functions
 virtual GS::UniString  | GetName () const =0
 virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
Detailed Description
Defining an interface for all event handlers.
Since
Archicad 26